import numpy as np


####################仅仅是一个示例###################################


# 双目相机参数

class stereoCamera(object):
    def __init__(self):
        # 左相机内参
        self.cam_matrix_left = np.array([[630.0328369140625, 0, 642.0654296875],
                                        [0, 630.0328369140625, 353.495361328125],
                                        [0, 0, 1]
                                        ])
        # 右相机内参
        self.cam_matrix_right = np.array([[630.0328369140625, 0, 642.0654296875],
                                         [0, 630.0328369140625, 353.495361328125],
                                         [0, 0, 1]
                                         ])

        # 左右相机畸变系数:[k1, k2, p1, p2, k3]
        self.distortion_l = np.array([[0.0, 0.0, 0.0, 0.0, 0.0]])
        self.distortion_r = np.array([[0.0, 0.0, 0.0, 0.0, 0.0]])

        # 旋转矩阵
        self.R = np.array([[1.0, 0.0, 0.0],
                          [0.0, 1.0, 0.0],
                          [0.0, 0.0, 1.0]
                          ])

        # 平移矩阵
        self.T = np.array([[-50.02383887767792], [0.0], [0.0]])  # 转换为毫米单位

        # 焦距
        self.focal_length = 630.0328369140625  # 使用fx值作为焦距

        # 基线距离
        self.baseline = 50.02383887767792  # 单位：mm，为平移向量的第一个参数（取绝对值）

        


